---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueRatio
source: html/de287d0b-45fc-fdf7-2655-230373ea70b8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentEndValueRatio Property

"End attachment ratio"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentEndValueRatio { get; }
```